---
kind: type
id: T:Autodesk.Revit.DB.IFC.IExporterIFC
source: html/d032aa74-3835-7cfa-7a8e-b5a8c1f4f7d0.htm
---
# Autodesk.Revit.DB.IFC.IExporterIFC

The interface used to implement a custom IFC exporter.

## Syntax (C#)
```csharp
public interface IExporterIFC : IExternalServer
```

## Remarks
Implement this interface and register an instance of the derived class with ExporterIFCRegistry.